---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightKey.#ctor
source: html/8464c8b6-bac6-93f8-0b6e-c557b795294d.htm
---
# Autodesk.Revit.DB.ExportLineweightKey.#ctor Method

Constructs a new default ExportLineweightKey.

## Syntax (C#)
```csharp
public ExportLineweightKey()
```